import time
import deck

row1 = ['╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ']

row2 = ['╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ']

row3 = ['╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ','╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ']

row4 = ['╔════╗','║▒▓▒▓║','║▓▒▓▒║','║▒▓▒▓║','╚════╝','      ']

opti = ['A     ','B     ','C     ','D     ']

suit = ['║♣   ║','║♡   ║','║♠   ║','║♢   ║']

nums = ['║ 𝐀  ║','║   1║','║ ⠁⠄ ║','║   2║','║ ⠡⠁ ║','║   3║','║ ⠅⠅ ║','║   4║','║ ⠺⠂ ║','║   5║','║ ⠇⠇ ║','║   6║','║ ⠿⠂ ║','║   7║','║ ⠯⠇ ║','║   8║','║ ⠿⠇ ║','║   9║','║ ⣻⡃ ║','║  10║','║ ♘  ║','║  11║','║ ♔  ║','║  12║','║ ♕  ║','║  13║']


def arrangeDeck():
    x = 0
    gameboard = ""
    while x < 24:
        gameboard += ((str(row1[x]).replace("'","")).replace("[","")).replace("]","")
        if 3 <= x <= 20:
            gameboard += ((str(row2[x-3]).replace("'","")).replace("[","")).replace("]","")
            if 6 <= x <= 17:
                gameboard += ((str(row3[x-6]).replace("'","")).replace("[","")).replace("]","")
                if 9 <= x <= 14:
                    gameboard += ((str(row4[x-9]).replace("'","")).replace("[","")).replace("]","")
        gameboard += "\n"
        x += 1
    return gameboard

print(arrangeDeck())

# def flip(int row, card, )
#     if row = 1:
#         row1[((card * 1) - 1) + card] = 

# decision = input("Welcome to the Pyramid (water) drinking-game! Would you like to begin? (y/n) \n")
# if decision == "y":
#     print()
#     print(arrangeDeck())
#     print("Here are your cards. You will be asked to pick a card from the first row and make an assumption. This will continue for all rows.")
#     time.sleep(5)
#     row1[5]  = opti[0]
#     row1[11] = opti[1]
#     row1[17] = opti[2]
#     row1[23] = opti[3]
#     print(arrangeDeck())
#     decision = input("Pick a card. (A/B/C/D) \n")
#     #if decision == "A":


# else:
#     print("Ok. Goodbye!")
#     quit()
